{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "Qwen2.5-Omni-7B/thinker",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "layers.7.mlp.up_proj",
    "model.layers.2.self_attn.v_proj",
    "layers.19.mlp.gate_proj",
    "layers.16.mlp.up_proj",
    "layers.2.mlp.down_proj",
    "model.layers.25.self_attn.k_proj",
    "model.layers.3.self_attn.k_proj",
    "layers.14.mlp.up_proj",
    "model.layers.7.self_attn.q_proj",
    "layers.17.mlp.down_proj",
    "model.layers.11.self_attn.v_proj",
    "layers.27.mlp.down_proj",
    "model.layers.25.self_attn.v_proj",
    "layers.18.mlp.up_proj",
    "layers.15.mlp.down_proj",
    "layers.8.mlp.gate_proj",
    "layers.3.mlp.down_proj",
    "model.layers.10.self_attn.v_proj",
    "layers.9.mlp.down_proj",
    "o_proj",
    "layers.4.mlp.gate_proj",
    "layers.18.mlp.down_proj",
    "layers.20.mlp.up_proj",
    "model.layers.1.self_attn.v_proj",
    "layers.23.mlp.down_proj",
    "layers.15.mlp.gate_proj",
    "layers.6.mlp.gate_proj",
    "model.layers.10.self_attn.k_proj",
    "model.layers.22.self_attn.q_proj",
    "layers.10.mlp.up_proj",
    "layers.14.mlp.down_proj",
    "model.layers.24.self_attn.q_proj",
    "layers.3.mlp.up_proj",
    "model.layers.27.self_attn.v_proj",
    "layers.5.mlp.up_proj",
    "layers.14.mlp.gate_proj",
    "layers.1.mlp.gate_proj",
    "model.layers.9.self_attn.k_proj",
    "layers.0.mlp.gate_proj",
    "model.layers.19.self_attn.v_proj",
    "layers.4.mlp.up_proj",
    "model.layers.16.self_attn.k_proj",
    "layers.12.mlp.up_proj",
    "layers.3.mlp.gate_proj",
    "model.layers.4.self_attn.k_proj",
    "layers.8.mlp.down_proj",
    "layers.21.mlp.down_proj",
    "model.layers.26.self_attn.q_proj",
    "layers.0.mlp.down_proj",
    "layers.7.mlp.down_proj",
    "model.layers.21.self_attn.k_proj",
    "model.layers.24.self_attn.k_proj",
    "layers.23.mlp.up_proj",
    "model.layers.18.self_attn.v_proj",
    "model.layers.3.self_attn.q_proj",
    "model.layers.19.self_attn.q_proj",
    "model.layers.13.self_attn.v_proj",
    "layers.21.mlp.gate_proj",
    "model.layers.20.self_attn.k_proj",
    "model.layers.5.self_attn.v_proj",
    "model.layers.23.self_attn.v_proj",
    "layers.1.mlp.down_proj",
    "layers.16.mlp.down_proj",
    "layers.20.mlp.gate_proj",
    "model.layers.23.self_attn.k_proj",
    "layers.13.mlp.down_proj",
    "layers.9.mlp.gate_proj",
    "model.layers.5.self_attn.q_proj",
    "layers.5.mlp.down_proj",
    "model.layers.0.self_attn.q_proj",
    "model.layers.5.self_attn.k_proj",
    "model.layers.16.self_attn.v_proj",
    "model.layers.21.self_attn.q_proj",
    "layers.10.mlp.down_proj",
    "model.layers.1.self_attn.q_proj",
    "layers.16.mlp.gate_proj",
    "model.layers.15.self_attn.v_proj",
    "model.layers.27.self_attn.q_proj",
    "model.layers.21.self_attn.v_proj",
    "layers.25.mlp.down_proj",
    "model.layers.26.self_attn.k_proj",
    "layers.15.mlp.up_proj",
    "layers.0.mlp.up_proj",
    "model.layers.6.self_attn.v_proj",
    "model.layers.14.self_attn.v_proj",
    "model.layers.4.self_attn.v_proj",
    "model.layers.13.self_attn.q_proj",
    "model.layers.18.self_attn.k_proj",
    "layers.2.mlp.gate_proj",
    "layers.13.mlp.gate_proj",
    "model.layers.11.self_attn.k_proj",
    "layers.7.mlp.gate_proj",
    "model.layers.6.self_attn.k_proj",
    "layers.22.mlp.gate_proj",
    "layers.24.mlp.up_proj",
    "layers.13.mlp.up_proj",
    "model.layers.15.self_attn.q_proj",
    "layers.17.mlp.gate_proj",
    "model.layers.12.self_attn.v_proj",
    "layers.19.mlp.up_proj",
    "model.layers.8.self_attn.v_proj",
    "model.layers.2.self_attn.q_proj",
    "layers.11.mlp.up_proj",
    "model.layers.12.self_attn.k_proj",
    "layers.27.mlp.up_proj",
    "layers.6.mlp.down_proj",
    "model.layers.9.self_attn.v_proj",
    "model.layers.14.self_attn.q_proj",
    "model.layers.13.self_attn.k_proj",
    "layers.1.mlp.up_proj",
    "layers.25.mlp.up_proj",
    "model.layers.18.self_attn.q_proj",
    "model.layers.27.self_attn.k_proj",
    "layers.4.mlp.down_proj",
    "model.layers.10.self_attn.q_proj",
    "layers.17.mlp.up_proj",
    "model.layers.7.self_attn.v_proj",
    "model.layers.8.self_attn.q_proj",
    "model.layers.24.self_attn.v_proj",
    "model.layers.15.self_attn.k_proj",
    "layers.23.mlp.gate_proj",
    "model.layers.25.self_attn.q_proj",
    "layers.18.mlp.gate_proj",
    "layers.26.mlp.up_proj",
    "layers.24.mlp.gate_proj",
    "layers.8.mlp.up_proj",
    "model.layers.14.self_attn.k_proj",
    "model.layers.19.self_attn.k_proj",
    "model.layers.7.self_attn.k_proj",
    "model.layers.2.self_attn.k_proj",
    "model.layers.9.self_attn.q_proj",
    "layers.12.mlp.gate_proj",
    "layers.10.mlp.gate_proj",
    "model.layers.0.self_attn.k_proj",
    "model.layers.1.self_attn.k_proj",
    "model.layers.6.self_attn.q_proj",
    "model.layers.8.self_attn.k_proj",
    "layers.6.mlp.up_proj",
    "layers.11.mlp.down_proj",
    "model.layers.17.self_attn.v_proj",
    "layers.26.mlp.down_proj",
    "model.layers.22.self_attn.k_proj",
    "model.layers.20.self_attn.v_proj",
    "model.layers.0.self_attn.v_proj",
    "layers.21.mlp.up_proj",
    "layers.25.mlp.gate_proj",
    "layers.27.mlp.gate_proj",
    "layers.22.mlp.up_proj",
    "layers.12.mlp.down_proj",
    "model.layers.3.self_attn.v_proj",
    "model.layers.26.self_attn.v_proj",
    "model.layers.16.self_attn.q_proj",
    "layers.20.mlp.down_proj",
    "model.layers.4.self_attn.q_proj",
    "layers.22.mlp.down_proj",
    "layers.19.mlp.down_proj",
    "layers.24.mlp.down_proj",
    "layers.11.mlp.gate_proj",
    "model.layers.17.self_attn.q_proj",
    "model.layers.11.self_attn.q_proj",
    "layers.9.mlp.up_proj",
    "model.layers.23.self_attn.q_proj",
    "layers.5.mlp.gate_proj",
    "model.layers.12.self_attn.q_proj",
    "model.layers.20.self_attn.q_proj",
    "layers.2.mlp.up_proj",
    "model.layers.17.self_attn.k_proj",
    "layers.26.mlp.gate_proj",
    "model.layers.22.self_attn.v_proj"
  ],
  "target_parameters": null,
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}